<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Microsoft's Teams installer package and installs it.</string>
    <key>Identifier</key>
    <string>com.github.dshore-aspen.install.microsoftteams</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Teams</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dshore-aspen.pkg.microsoftteams</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>